Catalogs/бит_Комнаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_Комнаты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.бит_Квартиры</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерКомнаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧастьПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_НазначениеЧастейПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонКвартир</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ШаблоныКвартир</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КадастровыйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УникальныйНомерГИСЖКХ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодтвержденоПоставщиком</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сведения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Высота</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Площадь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/бит_СведенияОКомнате.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СведенияОКомнате</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Высота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Площадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Комната</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Комнаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/бит_Комнаты/Forms/ФормаЭлементаУправляемая/Ext/Form/Module.bsl
#Область ПроцедурыОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	         
	Если Параметры.Свойство("НаДату") Тогда
		НаДату = Параметры.НаДату;
	КонецЕсли;
	
	ОбновитьОтбор();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СоздатьАдрес();	  
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ЧастьПомещенияПриИзменении(Элемент)
	СоздатьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура НомерКомнатыПриИзменении(Элемент)
	СоздатьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
    СоздатьАдрес();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьНовый(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Ответ = Неопределено;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("СоздатьНовыйЗавершение1", ЭтотОбъект), "Элемент еще не записан. Записать?", РежимДиалогаВопрос.ДаНет);
        Возврат;
		
	КонецЕсли;
	
	СоздатьНовыйФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовыйЗавершение1(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Ответ = РезультатВопроса;
    
    Если Ответ = КодВозвратаДиалога.Да Тогда
        Попытка	
            ЗаписатьЭлемент();
        Исключение

			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("" + ОписаниеОшибки());
			
            Возврат;
        КонецПопытки;	
    Иначе
        Возврат;                                            
    КонецЕсли;
    
    СоздатьНовыйФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовыйФрагмент()
    
    Перем ПараметрыФормы;
    
    Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
        Возврат;
    КонецЕсли; 
    
    Если ЗначениеЗаполнено(НаДату) Тогда
        ПараметрыФормы = Новый Структура("Основание", Новый Структура("Комната, Период", Объект.Ссылка, НаДату));
    Иначе	
        ПараметрыФормы = Новый Структура("Основание", Новый Структура("Комната, Период", Объект.Ссылка, ТекущаяДата()));
    КонецЕсли; 
    
    ОткрытьФорму("РегистрСведений.бит_СведенияОКомнате.Форма.ФормаЗаписиУправляемая", ПараметрыФормы,,,,, Новый ОписаниеОповещения("СоздатьНовыйЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовыйЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    ОбновитьОтбор();

КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьЭлемент()

	Записать();

КонецПроцедуры

&НаСервере
Процедура ОбновитьОтбор()

	Отбор = ДинСписок.Отбор.Элементы;
	
	Отбор.Очистить();
	
	УсловиеОтбора = Отбор.Добавить(тип("ЭлементОтбораКомпоновкиДанных"));
	УсловиеОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Комната");
	УсловиеОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	УсловиеОтбора.ПравоеЗначение = Объект.Ссылка;

	Если ЗначениеЗаполнено(НаДату) Тогда
		
		УсловиеОтбора = Отбор.Добавить(тип("ЭлементОтбораКомпоновкиДанных"));
		УсловиеОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Период");
		УсловиеОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
		УсловиеОтбора.ПравоеЗначение = НаДату;
		
	КонецЕсли;
	
КонецПроцедуры //бит() 

&НаКлиенте
Процедура СоздатьНаименование()
	
	Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
		
		Если Объект.НомерКомнаты <> 0 И ЗначениеЗаполнено(Объект.ЧастьПомещения) Тогда
			
			Объект.Наименование = Строка(Объект.НомерКомнаты) + " " + Строка(Объект.ЧастьПомещения);
			
		Иначе
			
			Объект.Наименование = Строка(Объект.ЧастьПомещения);
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьАдрес()

	Район = ?(ЗначениеЗаполнено(Объект.Владелец.Владелец.Район),"р-н "+Строка(Объект.Владелец.Владелец.Район),"");
	Улица = ?(ЗначениеЗаполнено(Объект.Владелец.Владелец.Улица)," ул. "+Строка(Объект.Владелец.Владелец.Улица),"");
	Корпус = ?(ЗначениеЗаполнено(Объект.Владелец.Владелец.Корпус)," корп. "+Строка(Объект.Владелец.Владелец.Корпус),"");
	Дом = ?(ЗначениеЗаполнено(Объект.Владелец.Владелец)," д. "+Строка(Объект.Владелец.Владелец),"");
	Адрес = Район + ?(ЗначениеЗаполнено(Улица),","+Улица,"")+ ?(ЗначениеЗаполнено(Корпус),","+Корпус,"") + ?(ЗначениеЗаполнено(Дом),","+Дом,"");

	Если ЗначениеЗаполнено(Адрес) Тогда
		АдресКвартиры = Строка(Адрес) + ", кв. " + Строка(Объект.Владелец);
	Иначе
		АдресКвартиры = "Нет адреса здания!";
	КонецЕсли; 

КонецПроцедуры

#КонецОбласти
